[
  {
    "name": "Neuro-Psychology",
    "description": [
      "Bridge Medical provides comprehensive neuropsychological assessments, treatments, and support for adults and children who struggle with cognitive deficits. Neuropsychology is a subspecialty of clinical psychology that is focused on understanding the brain–behavior relationship. It seeks to uncover the cognitive, behavioral, and emotional difficulties that can result from known or suspected brain dysfunction. Neuropsychological evaluation consists of a comprehensive examination of cognitive and behavioral functioning. Evaluations comprise measures that are standardized, scored objectively, and have established psychometric properties. Bridge Medical’s neuropsychological evaluation includes a clinical interview with the patient, a collateral interview with caregivers/family, and a thorough review of relevant medical records. The evaluation is administered by paper/pencil and computer-based assessments, which measure the patient’s cognitive strengths and weaknesses.",
      "Intelligence",
      "Attention",
      "Executive Functioning",
      "Working Memory",
      "Speed of Processing",
      "Learning and Memory",
      "Visual Special Skills",
      "Fine Motor Skills",
      "Using the assessment results, Bridge Medical provides a report to the referring physician that includes a cognitive profile, detailed recommendations, objective information about the patient’s functioning, and any cognitive training recommended to improve functioning. Bridge Medical also offers neuropsychological re-evaluation, which effectively measures improvement associated with the cognitive treatment and determines if further treatment is warranted.",
      "Referral: Attorneys and doctors within the Company’s extensive network refer patients to Bridge Medical.",
      "Evaluation: Patients enter the program through a comprehensive neuropsychological assessment.",
      "Review: Following the evaluation, a comprehensive written report, together with statistical scoring, is provided to the patient and referring physician or attorney.",
      "Treatment Plan: If cognitive or psychological treatment is recommended, Bridge Medical will develop a personalized treatment program for the patient based upon his or her unique strengths and weaknesses.",
      "Treatment: One course of cognitive treatment is typically composed of four to six hours of weekly therapy, across a span of six to twelve months. Psychotherapy, if needed, can be administered weekly, bi-weekly or monthly.",
      "Progress: Cognitive rehabilitation assistants record each patient’s daily progress. Psychologists on staff also regularly assess patients and closely oversee all ongoing treatments.",
      "Re-Evaluation: Following the first course of treatment, after approximately six months, Bridge Medical conducts a re-evaluation to assess the patient’s language and cognitive improvements. It is common for Bridge Medical to recommend a brief course of treatment that lasts less than one to three months to treat residual deficits.",
      "Professional Assistance: Bridge Medical’s staff assists the patients on school/job-related tasks as-needed, and helps the patients with not only the cognitive retraining course, but also the demands of daily life. Bridge Medical’s goal is to restore patients to the highest level of function possible.",
      "Legal Resources: Finally, Bridge Medical works closely with patients’ attorneys to facilitate the resolution of legal and insurance matters throughout the treatment process."
    ]
  },
  {
    "name": "Cognitive Therapy",
    "description": "Neuropsychology Testing\nBridge Medical provides comprehensive neuropsychological assessments, treatments, and support for adults and children who struggle with cognitive deficits. Neuropsychology is a subspecialty of clinical psychology that is focused on understanding the brain–behavior relationship. It seeks to uncover the cognitive, behavioral, and emotional difficulties that can result from known or suspected brain dysfunction. Neuropsychological evaluation consists of a comprehensive examination of cognitive and behavioral functioning. Evaluations comprise measures that are standardized, scored objectively, and have established psychometric properties. Bridge Medical’s neuropsychological evaluation includes a clinical interview with the patient, a collateral interview with caregivers/family, and a thorough review of relevant medical records. The evaluation is administered by paper/pencil and computer-based assessments, which measure the patient’s cognitive strengths and weaknesses. The assessments focus on the following areas of cognition:\n\n• Intelligence\n\n• Attention\n\n• Executive Functioning\n\n• Working Memory\n\n• Speed of Processing\n\n• Learning and Memory\n\n• Visual Special Skills\n\n• Fine Motor Skills\n\nUsing the assessment results, Bridge Medical provides a report to the referring physician that includes a cognitive profile, detailed recommendations, objective information about the patient’s functioning, and any cognitive training recommended to improve functioning. Bridge Medical also offers neuropsychological re-evaluation, which effectively measures improvement associated with the cognitive treatment and determines if further treatment is warranted.\n\nCognitive Rehabilitation\nBridge Medical’s approach to cognitive rehabilitation is restorative in nature. Based upon an analysis of the functions assessed through the neuropsychological evaluation, Bridge Medical makes a determination as to the cognitive strengths and weaknesses presented by the patient and designs a program of intervention or treatment plan. Cognitive rehabilitation is based on the principle of neuroplasticity, meaning that the human brain is not a static organ but capable of physical change. These changes can occur through neural pathways and synapses after exposure to enriched environments. Cognitive remediation provides such an enriched environment.\n\nBridge Medical offers cognitive treatment that consists of exercises through the use of computer software based on a number of theoretical models of cognitive functions, such as attention, memory and executive function. The parameters usually monitored in the cognitive rehabilitation interventions used at Bridge Medical include reaction time, level of exercise difficulty, average number of correct responses, and average number of incorrect responses, among others. The proportion of successes in any session is closely monitored by our trained therapists. The overall purpose is to restore, reinforce, compensate and teach compensatory strategies in order to reach optimal cognitive improvement."
  },
  {
    "name": "Psychology",
    "description": "Psychotherapy, otherwise known as talk therapy, is a method of mental health treatment aimed at helping people with a variety of psychiatric disorders and stressors. Therapy can help reduce suffering, provide a different method of conceptualizing difficult situations, improve problem-solving skills, help individuals achieve their respective goals, and increase overall quality of life. Furthermore, according to the National Institutes of Health, there is growing evidence showing the relationship and importance of understanding the mind-body connection. In other words, understanding the bidirectional relationship between human thought, feeling, behavior, and physical wellbeing.\n\nAt Bridge Medical, each mental health professional collaborates with patients to carefully devise a treatment plan using a variety of evidence-based psychotherapies in accordance with his or her training and expertise. Evidence-based therapy uses psychological techniques based on empirical scientific research. Traditionally, evidence-based psychotherapy is structured, goal-oriented, and present-focused. It has been shown as an effective treatment for a variety of comorbid psychiatric and medical conditions. The focus of treatment varies depending on each individual’s presenting concerns and can be provided in an individual and/or group format as needed.\n\nIndividual Psychotherapy is a collaborative process between a trained mental health professional and patient in psychotherapy with a focus on improving his or her subjective emotional wellbeing, stress management, and coping strategies. Individuals seek therapy for a variety of reasons, such as to process major life stressors/adjustments or to increase self-knowledge and growth. At Bridge Medical, our providers work with patients on a one-to-one basis in a safe and confidential environment to explore stressors, set goals, and provide each patient with the tools to increase their autonomy and overall emotional well-being.\n\nGroup Psychotherapy is a form of therapy that involves one or more therapists working with a group of patients to discuss common problems and challenges. Group therapy provides a platform to help individuals with emotional difficulties through interactive and constructive feedback, a supportive environment of peers with similar experiences, and reduces feelings of loneliness and social isolation. As each patient has a unique approach to learning, our team provides therapy material in various formats (e.g., paper, smartphone applications, audio/video presentations, etc.).\n\nBridge Medical provides psychotherapy for a number of patients diagnosed with a traumatic brain injury and/or concussion. Often, post-brain injury, many patients commonly experience difficulties controlling emotions ('mood swings') for a variety of reasons, personality changes, and/or challenges adjusting to significant changes in relationships and responsibilities. As a result, patients may experience depression, anxiety, anger, and a general sense of loss. Far too often, coping with a brain injury and/or mental illness is categorized under the umbrella of being diagnosed with an invisible illness. However, as providers, Bridge Medical is determined to educate, advocate for, and empower each patient to maximize their recovery."
  },
  {
    "name": "Psychiatry",
    "description": [
      "Treatment: Diagnosis and treatment for various mental health disorders pertaining to injuries sustained in car accidents, work‑related injuries, and assaults.",
      "Support: Providing emotional and behavioral support to individuals facing challenges.",
      "Advocacy: Advocating for mental health and well‑being.",
      "Combination of medical expertise and therapeutic approaches: Psychiatrists offer talk therapy, medications, strategies, and tailored treatments."
    ]
  }
]
